{
  "@context": "https://schema.org",
  "@type": "FAQPage",
  "mainEntity": [
    {
      "@type": "Question",
      "name": "What are the limitations / current challenges of this technology?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "**Scale**: Network sizes need to increase to match the performance of ANNs, both in simulation and hardware. Crossbar arrays in analog hardware can potentially scale up the parameter count.\n\n**Architectures:** SNN hardware is still tied to ANN/CNN architectures, and applying transformers to spikes directly is not straightforward.\n\n**Training methods:** Backpropagation through time is expensive and won't scale to large network sizes. Forward propagation or chip-in-the-loop training could help.\n\n**Standards:** Lack of standardized neuron models and common training techniques in the interdisciplinary field of neuromorphic computing. Efforts like Neuromorphic Intermediate Representation and a growing landscape of training frameworks aim to address this."
      }
    },
    {
      "@type": "Question",
      "name": "Can I access / buy neuromorphic hardware?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "In September 2023, neuromorphic cameras are available off the shelf (Prophesee, iniVation). The situation for backend hardware varies:\n- Speck and Xylo made by SynSense can be bought directly from [SynSense](https://www.synsense.ai/products/).\n- SpiNNaker and BrainScaleS systems are available for free via the [ebrains](https://www.ebrains.eu/modelling-simulation-and-computing/computing/neuromorphic-computing/) platform.\n- Loihi is available through joining [INRC](https://intel-ncl.atlassian.net/wiki/spaces/INRC/overview?homepageId=196610).\n- Akida by Brainchip can be bought directly from [Brainchip](https://brainchip.com/akida2-0/)."
      }
    },
    {
      "@type": "Question",
      "name": "How does neuromorphic relate to quantum computing?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "1. Both paradigms diverge from classical computing but aim to address its limitations. Neuromorphic computing mimics the architecture of biological neural networks and excels at pattern recognition and learning tasks. In contrast, quantum computing is based on the principles of quantum mechanics and is advantageous for problems like optimization and simulation that are computationally hard for classical systems. Advances in materials science and fabrication techniques are crucial for both, and there's theoretical potential for hybrid systems that leverage the strengths of each technology."
      }
    }
  ]
}
